/* 
для запуска команда npm start
ссылка пробного бота: https://t.me/vwvwev_bot

*/

const { Telegraf } = require('telegraf')

// Создаем бота с помощью токена
const bot = new Telegraf('5931695934:AAE1U90YPHzvT99h3ydER7SAPL9HKwnH4WU')

console.log('Запуск бота...')

// Обработчик команды /start
bot.start(ctx => {
	ctx.reply(
		'Добро пожаловать! Для просмотра списка доступных команд. Кош келиңиз! Жеткиликтүү буйруктардын тизмесин көрүү үчүн. /help'
	)
})

// Обработчик команды /help
bot.help(ctx => {
	ctx.reply(
		'Список доступных команд: \n/lesson - курс по компьютерной граматике. Видео формат. \n/textlesson - курс по компьютерной граматике. Текстовый формат.Жеткиликтүү буйруктардын тизмеси: \n/lesson - компьютердик грамматика курсу. Видео формат. \n/textlesson сабак - компьютердик грамматика курсу. Текст форматы.'
	)
})

// Обработчик команды /lesson
bot.command('lesson', ctx => {
	// Отправляем клавиатуру с вариантами выбора темы обучения
	ctx.reply('Выберите тему обучения/Окуу темасын тандаңыз:', {
		reply_markup: {
			inline_keyboard: [
				[
					{
						text: 'Основы компьютеров/Компьютерлердин негиздери',
						callback_data: 'computer_basics',
					},
					{ text: 'Операционные системы/OS', callback_data: 'os' },
				],
				[
					{
						text: 'Работа с файлами и папками/Файлдар жана папкалар менен иштөө',
						callback_data: 'filfolders',
					},
					{
						text: 'Работа с электронной почтой/Электрондук почта менен иштөө',
						callback_data: 'email',
					},
				],
				[
					{
						text: 'Работа с информацией/Маалымат менен иштөө',
						callback_data: 'info',
					},
					{
						text: 'Основы программирования/Программалоонун негиздери',
						callback_data: 'cs50',
					},
				],
			],
		},
	})
})

// Обработчик нажатий на кнопки клавиатуры
bot.action('computer_basics', ctx => {
	ctx.reply(
		'Вам доступны следующие курсы по основам компьютеров/Компьютердин негиздери боюнча төмөнкү курстар сизге жеткиликтүү: https://www.youtube.com/watch?v=hscJXcQXOS4'
	)
	// Здесь можно отправлять пользователю ссылки на курсы и другие обучающие материалы по выбранной теме
})

bot.action('os', ctx => {
	ctx.reply(
		'Вам доступны следующие курсы по операционным системам/Төмөнкү операциялык система курстары сизге жеткиликтүү: https://www.youtube.com/watch?v=SZ1Qnz-0U2Q'
	)
	// Здесь можно отправлять пользователю ссылки на курсы и другие обучающие материалы по выбранной теме
})

bot.action('filfolder', ctx => {
	ctx.reply(
		'Вам доступны следующие курсы по работе с  файлами и папками/Файлдар жана папкалар менен иштөө боюнча төмөнкү курстар сиз үчүн жеткиликтүү: https://www.youtube.com/watch?v=oTWXeXeuu0A'
	)
	// Здесь можно отправлять пользователю ссылки на курсы и другие обучающие материалы по выбранной теме
})

bot.action('email', ctx => {
	ctx.reply(
		'Вам доступны следующие курсы по работе с электронной почтой/Төмөнкү электрондук курстар сизге жеткиликтүү: https://www.youtube.com/watch?v=tUijED_tCDM'
	)
	// Здесь можно отправлять пользователю ссылки на курсы и другие обучающие материалы по выбранной теме
})

bot.action('info', ctx => {
	ctx.reply(
		'Вам доступны следующие курсы по работе с информацией/Төмөнкү маалымат башкаруу курстары сиз үчүн жеткиликтүү: https://www.youtube.com/watch?v=rb1f06_LPRM'
	)
	// Здесь можно отправлять пользователю ссылки на курсы и другие обучающие материалы по выбранной теме
})

bot.action('cs50', ctx => {
	ctx.reply(
		'Вам доступны следующие плейлист курсов по основам программирования от CS50/CS50 программасынан программалоонун негиздери боюнча курстардын төмөнкү ойнотмо тизмеси сизге жеткиликтүү: https://youtu.be/Sy_wba7l1UU'
	)
	// Здесь можно отправлять пользователю ссылки на курсы и другие обучающие материалы по выбранной теме
})

// Обработчик команды /textlesson
bot.command('textlesson', ctx => {
	// Отправляем клавиатуру с вариантами выбора темы обучения
	ctx.reply('Окуу темасын тандаңыз:', {
		reply_markup: {
			inline_keyboard: [
				[
					{
						text: 'Компьютерлердин негиздери',
						callback_data: 'computer_basics_text',
					},
					{ text: 'Операционные системы/OS', callback_data: 'os_text' },
				],
				[
					{
						text: 'Файлдар жана папкалар менен иштөө',
						callback_data: 'filfolders_text',
					},
					{
						text: 'Электрондук почта менен иштөө',
						callback_data: 'email_text',
					},
				],
				[
					{ text: 'Маалымат менен иштөө', callback_data: 'info_text' },
					{
						text: 'Программалоо курстары үчүн ноутбуктун спецификациялары',
						callback_data: 'b_text',
					},
				],
			],
		},
	})
})

// Обработчик нажатий на кнопки клавиатуры
bot.action('computer_basics_text', ctx => {
	ctx.reply(
		'Компьютерлердин негиздери: Компьютер – маалыматтарды эсептөө, сактоо, алуу жана өткөрүү сыяктуу милдеттерди аткара ала турган аппараттык жана программалык компоненттерден турган түзүлүш. Аппараттык компоненттерге процессор, оперативдүү эс тутум, катуу диск жана киргизүү/чыгаруу түзүлүштөрү сыяктуу физикалык түзүлүштөр кирет.'
	)
	// Здесь можно отправлять пользователю ссылки на курсы и другие обучающие материалы по выбранной теме
})

bot.action('os_text', ctx => {
	ctx.reply(
		'Операциялык системалар (OS) компьютер ресурстарын башкарган жана башка программаларды иштетүүгө мүмкүндүк берүүчү программалык камсыздоо.Windows: Компьютерлер үчүн эң популярдуу операциялык система'
	)
	// Здесь можно отправлять пользователю ссылки на курсы и другие обучающие материалы по выбранной теме
})

bot.action('filfolder_text', ctx => {
	ctx.reply(
		'Файлдар жана папкалар: Windowsта папкаларды түзүү - бул чычканды бир нече чыкылдатуу менен бүтүрө турган жөнөкөй операция. Windowsта жаңы папканы түзүү үчүн, бул кадамдарды аткарыңыз: 1.Жаңы папка түзгүңүз келген иш тактаңыздагы же папкадагы бош мейкиндикти оң баскыч менен чыкылдатыңыз. 2.Контексттик менюдан "Жаңы" жана андан кийин "Папканы" тандаңыз. 3.Жаңы папканын атын киргизип, Enter баскычын басыңыз. Тандалган папкада жаңы папка түзүлөт. Windowsта папканы жок кылуу үчүн, төмөнкү кадамдарды аткарыңыз: 1.Жок кылгыңыз келген папканы табыңыз жана аны оң баскыч менен басыңыз.2. Контексттик менюдан "Жок кылуу" дегенди тандаңыз. 3."Ооба" параметрин тандоо менен папканы жок кылууну ырастаңыз. Папканы жок кылуу ошол папкадагы бардык файлдарды жана ички папкаларды жок кыларын эске алыңыз. Ошондуктан, папканы жок кылуудан мурун, маанилүү маалыматтарды жок кылбаңыз.'
	)
	// Здесь можно отправлять пользователю ссылки на курсы и другие обучающие материалы по выбранной теме
})

bot.action('email_text', ctx => {
	ctx.reply(
		'Почта кызматтары менен кантип иштөө керек: Почта кызматы менен иштөө үчүн сиз каттоо эсебин түзүшүңүз керек. Бул үчүн, тандалган почта кызматынын сайтына кирип, "Аккаунт түзүү" же "Катталуу" баскычын чыкылдатыңыз. Андан кийин нускамаларды аткарып, колдонуучу аты, сырсөз, туулган датасы ж.б. сыяктуу керектүү талааларды толтуруңуз.Каттоо эсебин түзгөндөн кийин, сиз электрондук почта менен иштей баштасаңыз болот. Жаңы билдирүү жөнөтүү үчүн "Жазуу" же "Жаңы билдирүү түзүү" баскычын басып, "Кимге" талаасына алуучунун электрондук почта дарегин киргизип, билдирүүнүн текстин жазып, "Жөнөтүү" баскычын басышыңыз керек.'
	)
	// Здесь можно отправлять пользователю ссылки на курсы и другие обучающие материалы по выбранной теме
})

bot.action('info_text', ctx => {
	ctx.reply(
		'Google да маалыматты кантип эффективдүү издөө керек: Google - бул ар кандай тема боюнча маалыматты табууга мүмкүндүк берген күчтүү издөө системасы.'
	)
	// Здесь можно отправлять пользователю ссылки на курсы и другие обучающие материалы по выбранной теме
})

bot.action('b_text', ctx => {
	ctx.reply(
		'Экран Иштеп чыгуучулар Full HD экранды тандашат - 1920 x 1080 токтому. Бул көбүрөөк иштөө мейкиндигин берет жана көздүн чарчоосун азайтууга жардам берет. RAM жана катуу диск канчалык көп болсо, ошончолук бул программаларды бир эле учурда иштете аласыз. Программалоо үчүн кеминде 8 ГБ оперативдүү эстутумду колдонуу сунушталат. CPU Бюджетти жаңы баштагандар үчүн төрт же алты ядролуу Intel Core i5 же ушул сыяктуу процессорлор классы иштейт.'
	)
	// Здесь можно отправлять пользователю ссылки на курсы и другие обучающие материалы по выбранной теме
})

bot.launch()
